# Задача 2: Найдите сумму цифр трехзначного числа.
# *Пример:*
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

num = int(input("Введите трехзначное число: "))
summa = 0

if num // 100 == 0 or num // 100 > 10:
    print("Введенное значение некорректно")
else:
    while num > 0:
        summa += num % 10
        num //= 10

    print(summa)
