# Напишите программу, которая принимает на вход строку, и отслеживает, сколько раз каждый символ уже встречался.
# Количество повторов добавляется к символам с помощью постфикса формата _n.

# Input: a a a b c a a d c d d
# Output: a a_1 a_2 b c a_3 a_4 d c_1 d_1 d_2

# Для решения данной задачи используйте функцию .split()

string = "a a a b c a a d c d d".split()

dic = {}.fromkeys(string, 0) # собирает словарь из чего-то

for i in string:
    if dic[i] != 0:
        print(f'{i}_{dic[i]}', end=" ")
    else:
        print(i, end=" ")
    dic[i] += 1
